import pandas as pd
df = pd.read_csv("movies.csv")

# Завдання 1:
# Яка назва фільму, який йде 22-м за списком?

# print(df.head(22))
# Manchester by the Sea 

# Завдання 2:
# Який жанр фільму під номером 984?

# print(df.tail(22))
# Comedy

# Завдання 3:
# Якого типу дані стовпця "Rating"?

# print(df["Rating"].describe())
# dtype: float64

# Завдання 4:
# Яке середнє значення стовпця "Year" (заокруглити до сотих)?

# print(df["Year"].describe())
# 2012.78

# Завдання 5:
# Якd кількість унікальних (unique) значень в стовпці "Genre"?

# print(df["Genre"].describe())
# unique                        207

# Завдання 6:
# Скільки фільмів зі списку зняв режисер "James Gunn"?

# print(len(df[df["Director"] == "James Gunn"]))
# 3

# Завдання 7:
# Скільки фільмів мають рейтинг 7.5?

# print(len(df[df["Rating"] == 7.5]["Rank"]))
# 35

# Завдання 8:
# Який максимальний рейтинг фільму жанру комедія "Comedy"?

# print(df[df["Genre"] == "Comedy"]["Rating"].max())
# 7.8

# Завдання 9:
# Яка середня кількість голосів у фільмів 2012 року (заокруглити до сотих)? 

# print(df[df["Year"] == 2012]["Votes"].mean())
# 285226.09

# Завдання 10:
# Яка різниця між максимальною та мінімальною оцінкою на "Metascore"? 

# a = df["Metascore"].min()
# b = df["Metascore"].max()
# print(b-a)
# 89

# Завдання 11:
# Який середній рейтинг у фільмів, довжина яких більше 150 хв та дата виходу пізніше 2011 року (заокруглити до сотих)? 

# print(df[(df["Runtime (Minutes)"] > 150 ) & (df["Year"] > 2011)]["Rating"].mean())
# 7.77

# Завдання 12 
# У скільки разів кількість фільмів жанру "драма" переважає комедії?

# c = len(df[df["Genre"] == "Drama"]["Rank"])
# d = len(df[df["Genre"] == "Comedy"]["Rank"])
# print(c/d)
# 1.5

# Завдання 13
# У скількох фільмах не вказано виторг "Revenue", тобто значення в комірці дорівнює NaN?

# print(len(df[df["Revenue (Millions)"].isnull()]))
# 128

# Завдання 14
# Визначити наскільки середня оцінка "Metascore" у фільмів 2014 року, тривалістю більше 120 хвилин та кількістю оцінювань понад 200000 відрізняється від середньої оцінки фільмів 2010 року, тривалістю більше 130 хвилин та касовими зборами більше 100 міліонів?

e = df[(df["Year"] == 2014) & (df["Runtime (Minutes)"] > 120) & (df["Votes"] > 200000)]["Metascore"].mean()
f = df[(df["Year"] == 2010) & (df["Runtime (Minutes)"] > 130) & (df["Revenue (Millions)"] > 100)]["Metascore"].mean()

print(e-f)